[ "Each client contains the following fields: name, address, the sum of the deposit, contract number, and term of the contract. \nThe program supports search through the database, import/export, addition of clients, deletion of clients, edition of clients. \nAlso, there are hotkeys available. To learn more, click on the tool strip menu. A combination of keys to the right of control is a shortcut(hotkey) to that control.", "To add a new client, click 'Client > Add' in tool strip menu, or press Ctrl + A. \nA new window will appear, where you should fill all fields available. When you're done, click 'Add client' or press Enter. The new client will appear in the database.", "To delete a client from the database, click on Client > Delete in the tool strip menu or press Ctrl + D. The search form will appear, in which you can choose 2 modes of deletion: by the last name and by the number of contract. If you choose deletion by the last name, all clients with exact same last name will be deleted. If you choose deletion by number of contract, the client with exact same number of contract will be deleted.", "To edit a client in the database, click on Client > Edit in the tool strip menu or press Ctrl + E. The search form will appear, in which you can enter the number of contract of the client to edit. If there is a client with the exact same number of contract, an edition form will appear, in which you can change this particular client's data. Alternatively, you can click on this client on the table. The same form will appear.\nNote: to edit client, you need to enter a password once.", "You can import/export database in .json. To do so, click on 'File > Import' or 'File > Export' or use the corresponding hotkeys. You can import in two modes: append (add import data to the current database), or replace (replace current data with a new database).", "To search through the database, you can click on the 'Search' button to the top and right from the table, or press Ctrl + F. The search form will appear, in which you can select 4 modes of search: by name ( full name should contain following symbols), by number of contract (exact same number of contract), contract term (term in days must exceed your entering), and the sum of deposit (deposit sum must exceed your entering)." ]